InformationRegisters/ЗаданияКОбработкеЭтаповПроизводства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>ЗаданияКОбработкеЭтаповПроизводства</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОбновитьСостояние</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаполнитьПоОперациям</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЭтапПроизводства</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЭтапПроизводства2_2</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДеньРегистрации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьНомерЗадания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЗаданияКОбработкеЭтаповПроизводства/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Добавляет записи в регистр заданий.
//
// Параметры:
//  ЭтапПроизводства - ДокументСсылка.ЭтапПроизводства2_2	 - этап, для которого необходимо добавить задание.
//  Действия		 - Структура							 - см. РегистрыСведений.ЗаданияКОбработкеЭтаповПроизводства.СтруктураДействий().
//
Процедура ДобавитьЗадание(ЭтапПроизводства, Действия) Экспорт
	
	Если Действия.ОбновитьСостояние ИЛИ Действия.ЗаполнитьПоОперациям Тогда
		
		Задание = НовоеЗадание(ЭтапПроизводства, Действия);
		Идентификаторы = ПроизводствоСервер.ДобавитьЗаданиеВОчередь("ЗаданияКОбработкеЭтаповПроизводства", Задание);
		
		Отбор = Новый Структура("ЭтапПроизводства", ЭтапПроизводства);
		ПроизводствоСервер.ЗапуститьЗаданиеОбработкиОчереди("ЗаданияКОбработкеЭтаповПроизводства", Отбор, Идентификаторы);
		
	КонецЕсли;
	
КонецПроцедуры

// Запускает в фоновом режиме задание заполнения этапов производства
//
Процедура ЗапуститьЗадание() Экспорт
	
	ПроизводствоСервер.ЗапуститьЗаданиеОбработкиОчереди("ЗаданияКОбработкеЭтаповПроизводства");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция НовоеЗадание(ЭтапПроизводства, Действия = Неопределено)
	
	Задание = Новый Структура("ЭтапПроизводства,ОбновитьСостояние,ЗаполнитьПоОперациям");
	
	Задание.ЭтапПроизводства = ЭтапПроизводства;
	
	Если Действия <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(Задание, Действия);
	КонецЕсли;
	
	Возврат Задание;
	
КонецФункции

Функция СтруктураДействий() Экспорт
	
	СтруктураДействий = Новый Структура("ОбновитьСостояние, ЗаполнитьПоОперациям", Ложь, Ложь);
	Возврат СтруктураДействий;
	
КонецФункции

Функция ПараметрыОбработки() Экспорт
	
	ПараметрыОбработки = Новый Структура;
	ПараметрыОбработки.Вставить("Обработчик", "Документы.ЭтапПроизводства2_2.ОбработатьДокументОтложенно");
	ПараметрыОбработки.Вставить("ДополнительныеДанные", Новый Структура);
	Возврат ПараметрыОбработки;
	
КонецФункции

Функция ОчередьЗаданий(Отбор = Неопределено) Экспорт

	ЗаданияКОбработке = ПроизводствоСервер.ОчередьЗаданий("ЗаданияКОбработкеЭтаповПроизводства", Отбор);
	Возврат ЗаданияКОбработке;
	
КонецФункции

Функция ВыбратьИзОчереди(МенеджерВременныхТаблиц) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ОбрабатываемыеЗадания.ЭтапПроизводства КАК ЭтапПроизводства,
	|
	|	МАКСИМУМ(ОбрабатываемыеЗадания.ОбновитьСостояние)    КАК ОбновитьСостояние,
	|	МАКСИМУМ(ОбрабатываемыеЗадания.ЗаполнитьПоОперациям) КАК ЗаполнитьПоОперациям
	|ИЗ
	|	ОбрабатываемыеЗадания КАК ОбрабатываемыеЗадания
	|
	|СГРУППИРОВАТЬ ПО
	|	ОбрабатываемыеЗадания.ЭтапПроизводства");
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Результат = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		
		Задание = НовоеЗадание(Выборка.ЭтапПроизводства);
		
		Если Выборка.ОбновитьСостояние ИЛИ Выборка.ЗаполнитьПоОперациям Тогда
			ЗаполнитьЗначенияСвойств(Задание, Выборка);
		Иначе
			Задание.ОбновитьСостояние = Истина;
			Задание.ЗаполнитьПоОперациям = Истина; // для "старых" заданий
		КонецЕсли;
		
		Результат.Добавить(Задание);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Процедура УдалитьЗадание(Задание, МенеджерВременныхТаблиц) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ОбрабатываемыеЗадания.Идентификатор КАК Идентификатор
	|ИЗ
	|	ОбрабатываемыеЗадания КАК ОбрабатываемыеЗадания
	|ГДЕ
	|	ОбрабатываемыеЗадания.ЭтапПроизводства = &ЭтапПроизводства");
	
	Запрос.УстановитьПараметр("ЭтапПроизводства", Задание.ЭтапПроизводства);
	
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Результат = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		
		Набор = РегистрыСведений.ЗаданияКОбработкеЭтаповПроизводства.СоздатьНаборЗаписей();
		
		Набор.Отбор.Идентификатор.Установить(Выборка.Идентификатор);
		
		Набор.Записать(Истина);
		
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Процедура ЗаписатьОшибку(Задание, ПропуститьЗадание, ИнформацияОбОшибке) Экспорт
	
	ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
	
	ПроизводствоСервер.ЗаписатьОшибкуОбработкиОчередиЗаданий("ЗаданияКОбработкеЭтаповПроизводства", ТекстОшибки, Задание);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
